; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v8 ?v13)
             (pred_10 ?v12 ?v10)
             (pred_6 ?v8 ?v10)
             (pred_8 ?v5 ?v8 )
	     (pred_4 ?v8)
             (pred_7 ?v6)
             (pred_12 ?v12)
             (pred_5 ?v10)
             (pred_9 ?v8)
             (pred_3 ?v12)
             (pred_11 ?v8)
             (pred_2 ))



(:action op_1
:parameters (?v3 ?v4 ?v9 ?v11)
:precondition (and (pred_7 ?v3) (pred_7 ?v4) (pred_12 ?v9) (pred_5 ?v11)
          (pred_1 ?v3 ?v4) (pred_10 ?v9 ?v11)
                   (pred_6 ?v4 ?v11) (pred_4 ?v3) 
                   (pred_9 ?v4) (pred_3 ?v9))
:effect (and  (pred_11 ?v4) (not (pred_9 ?v4))))


(:action op_3
:parameters (?v3 ?v2)
:precondition (and (pred_7 ?v3) (pred_7 ?v2)
               (pred_4 ?v3) (pred_1 ?v3 ?v2) (pred_11 ?v2))
:effect (and (pred_4 ?v2) (not (pred_4 ?v3))))

(:action op_4
:parameters (?v3 ?v9)
:precondition (and (pred_7 ?v3) (pred_12 ?v9) 
                  (pred_4 ?v3) (pred_8 ?v9 ?v3) (pred_2 ))
:effect (and (pred_3 ?v9)
   (not (pred_8 ?v9 ?v3)) (not (pred_2 ))))


(:action op_5
:parameters (?v3 ?v7 ?v1)
:precondition (and (pred_7 ?v3) (pred_12 ?v7) (pred_12 ?v1)
                  (pred_4 ?v3) (pred_3 ?v1) (pred_8 ?v7 ?v3))
:effect (and (pred_3 ?v7) (pred_8 ?v1 ?v3)
        (not (pred_3 ?v1)) (not (pred_8 ?v7 ?v3))))

(:action op_2
:parameters (?v3 ?v9)
:precondition (and (pred_7 ?v3) (pred_12 ?v9) 
                  (pred_4 ?v3) (pred_3 ?v9))
:effect (and (pred_2 ) (pred_8 ?v9 ?v3) (not (pred_3 ?v9)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_09 obj_06 obj_19 obj_05 obj_16 obj_14 obj_03 obj_02 obj_13 obj_10 obj_20 obj_07 obj_11 obj_15 obj_18
    obj_17 obj_21
    obj_01 obj_04 obj_08
    )

    (:init
       (pred_2)

       (pred_7 obj_12)
       (pred_7 obj_09)
       (pred_7 obj_06)
       (pred_7 obj_19)
       (pred_7 obj_05)
       (pred_7 obj_16)
       (pred_7 obj_14)
       (pred_7 obj_03)
       (pred_7 obj_02)
       (pred_7 obj_13)
       (pred_7 obj_10)
       (pred_7 obj_20)
       (pred_7 obj_07)
       (pred_7 obj_11)
       (pred_7 obj_15)
       (pred_7 obj_18)
       (pred_5 obj_17)
       (pred_5 obj_21)
       (pred_12 obj_01)
       (pred_12 obj_04)
       (pred_12 obj_08)

       (pred_1 obj_12 obj_05)
       (pred_1 obj_12 obj_09)
       (pred_1 obj_09 obj_16)
       (pred_1 obj_09 obj_06)
       (pred_1 obj_09 obj_12)
       (pred_1 obj_06 obj_14)
       (pred_1 obj_06 obj_19)
       (pred_1 obj_06 obj_09)
       (pred_1 obj_19 obj_03)
       (pred_1 obj_19 obj_06)
       (pred_1 obj_05 obj_02)
       (pred_1 obj_05 obj_16)
       (pred_1 obj_05 obj_12)
       (pred_1 obj_16 obj_13)
       (pred_1 obj_16 obj_14)
       (pred_1 obj_16 obj_09)
       (pred_1 obj_16 obj_05)
       (pred_1 obj_14 obj_10)
       (pred_1 obj_14 obj_03)
       (pred_1 obj_14 obj_06)
       (pred_1 obj_14 obj_16)
       (pred_1 obj_03 obj_20)
       (pred_1 obj_03 obj_19)
       (pred_1 obj_03 obj_14)
       (pred_1 obj_02 obj_07)
       (pred_1 obj_02 obj_13)
       (pred_1 obj_02 obj_05)
       (pred_1 obj_13 obj_11)
       (pred_1 obj_13 obj_10)
       (pred_1 obj_13 obj_16)
       (pred_1 obj_13 obj_02)
       (pred_1 obj_10 obj_15)
       (pred_1 obj_10 obj_20)
       (pred_1 obj_10 obj_14)
       (pred_1 obj_10 obj_13)
       (pred_1 obj_20 obj_18)
       (pred_1 obj_20 obj_03)
       (pred_1 obj_20 obj_10)
       (pred_1 obj_07 obj_11)
       (pred_1 obj_07 obj_02)
       (pred_1 obj_11 obj_15)
       (pred_1 obj_11 obj_13)
       (pred_1 obj_11 obj_07)
       (pred_1 obj_15 obj_18)
       (pred_1 obj_15 obj_10)
       (pred_1 obj_15 obj_11)
       (pred_1 obj_18 obj_20)
       (pred_1 obj_18 obj_15)
       (pred_9 obj_07)
       (pred_9 obj_18)
       (pred_9 obj_11)
       (pred_6  obj_07 obj_17)
       (pred_6  obj_18 obj_21)
       (pred_6  obj_11 obj_17)
       (pred_11 obj_12)
       (pred_11 obj_09)
       (pred_11 obj_06)
       (pred_11 obj_19)
       (pred_11 obj_05)
       (pred_11 obj_16)
       (pred_11 obj_14)
       (pred_11 obj_03)
       (pred_11 obj_02)
       (pred_11 obj_13)
       (pred_11 obj_10)
       (pred_11 obj_20)
       (pred_11 obj_15)

       (pred_10  obj_01 obj_17)
       (pred_10  obj_04 obj_21)
       (pred_10  obj_08 obj_17)
       (pred_8 obj_01 obj_03)
       (pred_8 obj_04 obj_19)
       (pred_8 obj_08 obj_09)
       (pred_4 obj_16)
    )

    (:goal (and
       (pred_8 obj_01 obj_14)
       (pred_8 obj_04 obj_13)
       (pred_8 obj_08 obj_19)
    ))
(:constraints
  (always (not (pred_4 obj_06)))
)
)

; plan
1. (op_3 obj_16 obj_14)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_14)
   goals met: 0 of 3
2. (op_3 obj_14 obj_03)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_03)
   goals met: 0 of 3
3. (op_4 obj_03 obj_01)
   deleted: (pred_8 obj_01 obj_03) (pred_2)
   added: (pred_3 obj_01)
   goals met: 0 of 3
4. (op_3 obj_03 obj_14)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_14)
   goals met: 0 of 3
5. (op_2 obj_14 obj_01)
   deleted: (pred_3 obj_01)
   added: (pred_2) (pred_8 obj_01 obj_14)
   goals met: 1 of 3
6. (op_3 obj_14 obj_16)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_16)
   goals met: 1 of 3
7. (op_3 obj_16 obj_09)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_09)
   goals met: 1 of 3
8. (op_4 obj_09 obj_08)
   deleted: (pred_8 obj_08 obj_09) (pred_2)
   added: (pred_3 obj_08)
   goals met: 1 of 3
9. (op_3 obj_09 obj_16)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_16)
   goals met: 1 of 3
10. (op_3 obj_16 obj_14)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_14)
   goals met: 1 of 3
11. (op_3 obj_14 obj_03)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_03)
   goals met: 1 of 3
12. (op_3 obj_03 obj_19)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_19)
   goals met: 1 of 3
13. (op_5 obj_19 obj_04 obj_08)
   deleted: (pred_3 obj_08) (pred_8 obj_04 obj_19)
   added: (pred_3 obj_04) (pred_8 obj_08 obj_19)
   goals met: 2 of 3
14. (op_3 obj_19 obj_03)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_03)
   goals met: 2 of 3
15. (op_3 obj_03 obj_14)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_14)
   goals met: 2 of 3
16. (op_3 obj_14 obj_16)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_16)
   goals met: 2 of 3
17. (op_3 obj_16 obj_13)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_13)
   goals met: 2 of 3
18. (op_2 obj_13 obj_04)
   deleted: (pred_3 obj_04)
   added: (pred_2) (pred_8 obj_04 obj_13)
   goals met: 3 of 3
